a5021/stm32-async-1wire/tests/test/test_state_machine.c
    /* Set state to READ */
    ds18b20_test_set_state(6);

    /* Simulate UIF set (read complete) */
    mock_tim1.SR |= TIM_SR_UIF;

    /* Poll should transition to DECODE state */
    ds18b20_poll();

    /* State should be DECODE (7) */
    TEST_ASSERT_EQUAL_UINT8(7, ds18b20_test_get_state());
}

/*-------------------------------------------------------------
 *  Test: DECODE state with valid CRC
 * -----------------------------------------------------------*/
void test_state_machine_decode_with_valid_crc(void) {
    ds18b20_init();
    ds18b20_test_reset_ctx();

    /* Set state to DECODE */
    ds18b20_test_set_state(7);

    /* Set up scratchpad with valid CRC */
    /* Temperature: 22.25°C -> raw = 0x0164 */
    uint8_t temp_data[9] = {0x64, 0x01, 0x4B, 0x46, 0x7F, 0xFF, 0x08, 0x10, 0};
    temp_data[8] = ds18b20_crc8(temp_data, 8); /* Compute valid CRC */

    for (int i = 0; i < 9; i++) {
        ds18b20_test_set_scratchpad(i, temp_data[i]);
    }

    /* Simulate UIF set */
    mock_tim1.SR |= TIM_SR_UIF;

    /* Poll should report valid temperature */
    ds18b20_poll();

    /* State should return to IDLE */
    TEST_ASSERT_EQUAL_UINT8(0, ds18b20_test_get_state());
}

/*-------------------------------------------------------------
 *  Test: DECODE state with invalid CRC
 * -----------------------------------------------------------*/
void test_state_machine_decode_with_invalid_crc(void) {
    ds18b20_init();
    ds18b20_test_reset_ctx();

    /* Set state to DECODE */
    ds18b20_test_set_state(7);

    /* Set up scratchpad with invalid CRC */
    uint8_t temp_data[9] = {0x64, 0x01, 0x4B, 0x46, 0x7F, 0xFF, 0x08, 0x10, 0xFF};
    /* CRC byte is 0xFF (incorrect) */

    for (int i = 0; i < 9; i++) {
        ds18b20_test_set_scratchpad(i, temp_data[i]);
    }

    /* Simulate UIF set */
    mock_tim1.SR |= TIM_SR_UIF;

    /* Poll should report CRC error */
    ds18b20_poll();

    /* State should return to IDLE */
    TEST_ASSERT_EQUAL_UINT8(0, ds18b20_test_get_state());
}

/*-------------------------------------------------------------
 *  Test: Invalid state triggers generic error
 * -----------------------------------------------------------*/
void test_state_machine_invalid_state_triggers_error(void) {
    ds18b20_init();
    ds18b20_test_reset_ctx();

    /* Set an invalid state (e.g., 255) */
    ds18b20_test_set_state(255);

    /* Simulate UIF set */
    mock_tim1.SR |= TIM_SR_UIF;

    /* Poll should report generic error and reset to IDLE */
    ds18b20_poll();

    TEST_ASSERT_EQUAL_UINT8(0, ds18b20_test_get_state());
}

/*-------------------------------------------------------------
 *  Test: Full cycle - Skip ROM mode
 * -----------------------------------------------------------*/
void test_state_machine_full_cycle_skip_rom(void) {
    ds18b20_init();
    ds18b20_test_reset_ctx();

    /* Ensure Skip ROM mode (no device selected) */
    ds18b20_test_set_address_mode(0);

    /* Simulate a full measurement cycle */
    /* Step 1: IDLE -> START -> CONVERT */
    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(2, ds18b20_test_get_state());

    /* Step 2: CONVERT -> WAIT (with valid presence) */
    ds18b20_test_set_edge(0, 510);
    ds18b20_test_set_edge(1, 700);
    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(3, ds18b20_test_get_state());

    /* Step 3: WAIT -> CONTINUE */
    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(4, ds18b20_test_get_state());

    /* Step 4: CONTINUE -> REQUEST (with valid presence) */
    ds18b20_test_set_edge(0, 510);
    ds18b20_test_set_edge(1, 700);
    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(5, ds18b20_test_get_state());

    /* Step 5: REQUEST -> READ (with valid presence) */
    ds18b20_test_set_edge(0, 510);
    ds18b20_test_set_edge(1, 700);
    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(6, ds18b20_test_get_state());

    /* Step 6: READ -> DECODE (with valid CRC) */
    /* Set up valid scratchpad */
    uint8_t temp_data[9] = {0x64, 0x01, 0x4B, 0x46, 0x7F, 0xFF, 0x08, 0x10, 0};
    temp_data[8] = ds18b20_crc8(temp_data, 8);
    for (int i = 0; i < 9; i++) {
        ds18b20_test_set_scratchpad(i, temp_data[i]);
    }

    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();

    /* READ transitions to DECODE (7) */
    TEST_ASSERT_EQUAL_UINT8(7, ds18b20_test_get_state());

    /* Step 7: DECODE -> IDLE (no UIF needed, processes immediately) */
    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();

    /* DECODE processes and returns to IDLE */
    TEST_ASSERT_EQUAL_UINT8(0, ds18b20_test_get_state());
}

/*-------------------------------------------------------------
 *  Test: State machine with Match ROM (address_mode = 1)
 * -----------------------------------------------------------*/
void test_state_machine_match_rom_mode(void) {
    ds18b20_init();
    ds18b20_test_reset_ctx();

    /* Select a device */
    uint8_t rom[8] = {0x28, 0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07};
    ds18b20_select(rom);

    /* Verify address mode is set */
    TEST_ASSERT_EQUAL_UINT8(1, ds18b20_test_get_address_mode());

    /* Go through CONVERT state in Match ROM mode */
    ds18b20_test_set_state(2);
    ds18b20_test_set_edge(0, 510);
    ds18b20_test_set_edge(1, 700);

    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();

    /* Should transition to WAIT */
    TEST_ASSERT_EQUAL_UINT8(3, ds18b20_test_get_state());
}

/*-------------------------------------------------------------
 *  Test: DECODE with all-zero scratchpad reports CRC error
 *  (BUG-3 fix: reserved bytes validation)
 * -----------------------------------------------------------*/
void test_state_machine_decode_all_zero_reports_error(void) {
    spy_reset();
    ds18b20_init();
    ds18b20_test_reset_ctx();

    /* Set state to DECODE */
    ds18b20_test_set_state(7);

    /* Set up all-zero scratchpad (bus fault condition) */
    for (int i = 0; i < 9; i++) {
        ds18b20_test_set_scratchpad(i, 0x00);
    }

    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();

    /* Callback must be called with CRC error */
    TEST_ASSERT_TRUE(spy_complete_called);
    TEST_ASSERT_EQUAL_INT(DS18B20_TEMP_ERROR_CRC_FAIL, spy_complete_value);

    /* State should return to IDLE */
    TEST_ASSERT_EQUAL_UINT8(0, ds18b20_test_get_state());
}

/*-------------------------------------------------------------
 *  Test: DECODE with all-0xFF scratchpad reports CRC error
 *  (BUG-3 fix: byte 7 must be 0x10, not 0xFF)
 * -----------------------------------------------------------*/
void test_state_machine_decode_all_FF_reports_error(void) {
    spy_reset();
    ds18b20_init();
    ds18b20_test_reset_ctx();

    /* Set state to DECODE */
    ds18b20_test_set_state(7);

    /* Set up all-0xFF scratchpad (bus stuck high) */
    for (int i = 0; i < 9; i++) {
        ds18b20_test_set_scratchpad(i, 0xFF);
    }

    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();

    /* Callback must be called with CRC error */
    TEST_ASSERT_TRUE(spy_complete_called);
    TEST_ASSERT_EQUAL_INT(DS18B20_TEMP_ERROR_CRC_FAIL, spy_complete_value);

    /* State should return to IDLE */
    TEST_ASSERT_EQUAL_UINT8(0, ds18b20_test_get_state());
}

/*-------------------------------------------------------------
 *  Test: DECODE with wrong reserved byte 5 reports error
 * -----------------------------------------------------------*/
void test_state_machine_decode_wrong_byte5_reports_error(void) {
    spy_reset();
    ds18b20_init();
    ds18b20_test_reset_ctx();

    /* Set state to DECODE */
    ds18b20_test_set_state(7);

