a5021/stm32-async-1wire/tests/test/test_state_machine.c
    TEST_ASSERT_EQUAL_UINT8(0, spy_busy_last_action);
}

/*-------------------------------------------------------------
 *  Test: NO_SENSOR error in the REQUEST state (after a
 *  successful CONVERT) reports the error and returns to IDLE
 * -----------------------------------------------------------*/
void test_state_machine_request_presence_fail(void) {
    spy_reset();
    ds18b20_init();
    ds18b20_test_reset_ctx();

    ds18b20_test_set_state(5);
    ds18b20_test_set_edge(0, 100); /* bad reset */
    ds18b20_test_set_edge(1, 100); /* bad presence */

    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();

    TEST_ASSERT_TRUE(spy_complete_called);
    TEST_ASSERT_EQUAL_INT(DS18B20_TEMP_ERROR_NO_SENSOR, spy_complete_value);
    TEST_ASSERT_EQUAL_UINT8(0, ds18b20_test_get_state());
}

/*-------------------------------------------------------------
 *  Test: CRC_FAIL in the middle of a full cycle - CONVERT passes,
 *  then the scratchpad read returns a bad CRC
 * -----------------------------------------------------------*/
void test_state_machine_crc_fail_mid_cycle(void) {
    spy_reset();
    ds18b20_init();
    ds18b20_test_reset_ctx();

    /* Full cycle with a corrupted scratchpad read */
    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(2, ds18b20_test_get_state());

    ds18b20_test_set_edge(0, 510);
    ds18b20_test_set_edge(1, 700);
    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(3, ds18b20_test_get_state());

    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(4, ds18b20_test_get_state());

    ds18b20_test_set_edge(0, 510);
    ds18b20_test_set_edge(1, 700);
    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(5, ds18b20_test_get_state());

    ds18b20_test_set_edge(0, 510);
    ds18b20_test_set_edge(1, 700);
    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(6, ds18b20_test_get_state());

    /* Corrupt the data so the CRC fails */
    uint8_t temp_data[9] = {0x64, 0x01, 0x4B, 0x46, 0x7F, 0xFF, 0x08, 0x10, 0};
    temp_data[8] = (uint8_t)(ds18b20_crc8(temp_data, 8) ^ 0xFF); /* bad CRC */
    for (int i = 0; i < 9; i++) {
        for (int b = 0; b < 8; b++) {
            ds18b20_test_set_pulse(i * 8 + b,
                                   (temp_data[i] >> b) & 1u ? 5u : 60u);
        }
    }

    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(7, ds18b20_test_get_state());

    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();

    TEST_ASSERT_TRUE(spy_complete_called);
    TEST_ASSERT_EQUAL_INT(DS18B20_TEMP_ERROR_CRC_FAIL, spy_complete_value);
    TEST_ASSERT_EQUAL_UINT8(0, ds18b20_test_get_state());
}

/*-------------------------------------------------------------
 *  Test: Full Skip-ROM cycle produces the exact temperature
 *  (matches the E2E Match-ROM value; Skip ROM broadcast mode)
 * -----------------------------------------------------------*/
void test_state_machine_full_cycle_skip_rom_value(void) {
    spy_reset();
    ds18b20_init();
    ds18b20_test_reset_ctx();
    ds18b20_test_set_address_mode(0);

    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(2, ds18b20_test_get_state());

    ds18b20_test_set_edge(0, 510);
    ds18b20_test_set_edge(1, 700);
    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(3, ds18b20_test_get_state());

    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(4, ds18b20_test_get_state());

    ds18b20_test_set_edge(0, 510);
    ds18b20_test_set_edge(1, 700);
    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(5, ds18b20_test_get_state());

    ds18b20_test_set_edge(0, 510);
    ds18b20_test_set_edge(1, 700);
    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(6, ds18b20_test_get_state());

    uint8_t temp_data[9] = {0x64, 0x01, 0x4B, 0x46, 0x7F, 0xFF, 0x08, 0x10, 0};
    temp_data[8] = ds18b20_crc8(temp_data, 8);
    for (int i = 0; i < 9; i++) {
        for (int b = 0; b < 8; b++) {
            ds18b20_test_set_pulse(i * 8 + b,
                                   (temp_data[i] >> b) & 1u ? 5u : 60u);
        }
    }

    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();
    TEST_ASSERT_EQUAL_UINT8(7, ds18b20_test_get_state());

    mock_tim1.SR |= TIM_SR_UIF;
    ds18b20_poll();

    TEST_ASSERT_TRUE(spy_complete_called);
    TEST_ASSERT_EQUAL_INT(223, spy_complete_value);
    TEST_ASSERT_EQUAL_UINT8(0, ds18b20_test_get_state());
}

/*-------------------------------------------------------------
 *  Run all state machine tests
 * -----------------------------------------------------------*/
void run_test_state_machine(void) {
    TEST_RUN(test_state_machine_initial_state_after_init);
    TEST_RUN(test_state_machine_first_poll_transitions_to_START);
    TEST_RUN(test_state_machine_UIF_clear_no_transition);
    TEST_RUN(test_state_machine_convert_with_presence_pass);
    TEST_RUN(test_state_machine_convert_with_presence_fail);
    TEST_RUN(test_state_machine_wait_transitions_to_continue);
    TEST_RUN(test_state_machine_continue_transitions_to_request);
    TEST_RUN(test_state_machine_request_with_presence_pass);
    TEST_RUN(test_state_machine_read_transitions_to_decode);
    TEST_RUN(test_state_machine_decode_with_valid_crc);
    TEST_RUN(test_state_machine_decode_with_invalid_crc);
    TEST_RUN(test_state_machine_invalid_state_triggers_error);
    TEST_RUN(test_state_machine_full_cycle_skip_rom);
    TEST_RUN(test_state_machine_match_rom_mode);
    TEST_RUN(test_state_machine_decode_all_zero_reports_error);
    TEST_RUN(test_state_machine_decode_all_FF_reports_error);
    TEST_RUN(test_state_machine_decode_wrong_byte5_reports_error);
    TEST_RUN(test_state_machine_search_select_measure_e2e);
    TEST_RUN(test_state_machine_init_configures_registers);
    TEST_RUN(test_state_machine_busy_spy);
    TEST_RUN(test_state_machine_request_presence_fail);
    TEST_RUN(test_state_machine_crc_fail_mid_cycle);
    TEST_RUN(test_state_machine_full_cycle_skip_rom_value);
}
